perf/helloMistery.yaml
config:
    environments:
      serverX:
        target: 'http://localhost:9090'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-node"
      serverY:
        target: 'http://localhost:9091'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-gunicorn"
    
  
    pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
  
    phases:
      - name: Warm up de la aplicacion
        duration: 30
        arrivalRate: 5
        rampTo: 20
      - name: Máxima carga sostenida
        duration: 120
        arrivalRate: 20
      
  
scenarios:
    - name: "Hello Word"
      flow:
        - get:
            url: '/'