perf/intensivo.yaml
config:
    environments:
      node:
        target: 'http://localhost:5555/node'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-node"
      gunicorn:
        target: 'http://localhost:5555/gunicorn'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-gunicorn"
      gunicorn_server_group:
        target: 'http://localhost:5555/gunicorn_group'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-gunicorn-group"
      gunicorn_2:
        target: 'http://localhost:5555/gunicorn_2Workers'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-gunicorn"
      node_2:
        target: 'http://localhost:5555/node_2Workers'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-node"
      
  
    pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
  
    phases:
      - name: Warm Up
        duration: 30
        arrivalRate: 5
      - name: Linear Ramp
        duration: 80
        arrivalRate: 5
        rampTo: 50
      - name: High Plain
        duration: 30
        arrivalRate: 50
      - name: Pause
        pause: 60
      - name: Non-linear Ramp
        duration: 120
        arrivalCount: 100
      - name: Non-linear Ramp 2
        duration: 60
        arrivalCount: 100
      - name: Active Pause
        duration: 30
        arrivalRate: 5
      - name: Non-linear Ramp 3
        duration: 30
        arrivalCount: 150        

scenarios:
    - name: "intensivo"
      flow:
        - get:
            url: '/intensivo'