perf/medio.yaml
config:
    environments:
      node:
        target: 'http://localhost:5555/node'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-node"
      gunicorn:
        target: 'http://localhost:5555/gunicorn'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-gunicorn"
      gunicorn_server_group:
        target: 'http://localhost:5555/gunicorn_group'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-gunicorn-group"
  
    pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
  
    phases:
      - name: Warm Up
        duration: 30
        arrivalRate: 5
      - name: Linear Ramp
        duration: 30
        arrivalRate: 5
        rampTo: 10
      - name: Pause
        pause: 10
      - name: Linear Ramp 2
        duration: 30
        arrivalRate: 10
        rampTo: 20
      - name: Plane
        duration: 30
        arrivalRate: 20  
      - name: Pause 2
        pause: 15
      - name: Linear Ramp 3
        duration: 30
        arrivalRate: 20
        rampTo: 30
      - name: Medium Plane
        duration: 40
        arrivalRate: 30    

scenarios:
    - name: "Medio"
      flow:
        - get:
            url: '/intensivo'