perf/timeout.yaml
config:
    environments:
      node:
        target: 'http://localhost:5555/node'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-node"
      gunicorn:
        target: 'http://localhost:5555/gunicorn'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-gunicorn"
      gunicorn_server_group:
        target: 'http://localhost:5555/gunicorn_group'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-gunicorn-group"

    pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
  
    phases:
      - name: Ramp
        duration: 30
        arrivalRate: 5
        rampTo: 20
      - name: Plain
        duration: 120
        arrivalRate: 20
      
  
scenarios:
    - name: "timeout"
      flow:
        - get:
            url: '/timeout'